export default {
  'brand': {
    'main': {
      'const-components': {
        'header': {
          'main': 'главная',
          'about': 'о нас',
          'listen': 'слушать',
        },
        'footer': {
          'not-real-project': 'Данный проект не является реальным сервисом.'
        }
      },
      'content': {
        'widgets': {
          'high-quality': {
            'title': 'Высокое качество звука',
            'content': 'Наслаждайтесь музыкой в высоком качестве с помощью нашего сервиса потоковой передачи аудио премиум-класса.',
          },
          'new-artists': {
            'title': 'Новые исполнители',
            'content': 'Откройте для себя новые таланты и расширьте свой музыкальный кругозор с помощью наших тщательно подобранных плейлистов начинающих исполнителей.',
          },
          'new-genres': {
            'title': 'Новые жанры и ощущения',
            'content': 'Исследуйте широкий спектр жанров и настроений: от веселых танцевальных треков до расслабляющего эмбиента.',
          },
          'new-opportunities': {
            'title': 'Делитесь своим музыкальным вкусом с друзьями.',
            'content': 'Общайтесь с друзьями и делитесь своими любимыми музыкальными открытиями, создавая персонализированные впечатления от прослушивания.'
          },
          'uploaded-tracks': {
            'title': 'Загружайте свои треки и слушайте их на одной платформе!',
            'content': 'Загрузите свои собственные треки и развивайтесь, как автор.'
          }
        },
        'intro': {
          'quote': 'Наслаждайтесь моментом, оценивайте авторов, делитесь плейлистами — ведь вы этого заслуживаете.',
          'quote-author': '- лидер Smotify',
          'main-title': 'Что вообще такое Smotify?',
          'main-subtitle': 'сервис для прослушивания, добавления, обмена треками.',
        }
      }
    },
    'about': {
      'about-widgets': {
        'unleash': `Smotify дает музыкантам всех уровней возможность поделиться своим талантом со всем миром.
          Загружайте свои оригинальные треки, создавайте плейлисты и привлекайте новых подписчиков.
          поклонники. Наша удобная платформа позволяет легко демонстрировать свою музыку и подключаться к
          глобальная аудитория.`,
        'explore': `Погрузитесь в обширную музыкальную библиотеку Smotify, охватывающую жанры и эпохи. Откройте для себя новых художников,
          исследуйте скрытые сокровища и создавайте персонализированные плейлисты, отражающие ваш уникальный вкус. Наша разумная рекомендация
          система поможет вам найти музыку, которая вам понравится.`,
        'connect': `Smotify способствует развитию активного сообщества любителей музыки. Делитесь любимыми треками, обсуждайте новые релизы и общайтесь с
          друзья-фанаты, которые разделяют вашу страсть к музыке. Участвуйте в оживленных беседах и вместе открывайте для себя новую музыку.`,
      },
      'main-title': 'Раскройте своего внутреннего музыканта.',
    },
  },
  'player': {
    '': ''
  }
} as const