export default {
  "brand": {
    "main": {
      "const-components": {
        "header": {
          "main": "главная",
          "about": "о нас",
          "start": "начать",
        },
        "footer": {
          "not-real-project": "Данный проект не является реальным сервисом.",
        },
      },
      "content": {
        "widgets": {
          "high-quality": {
            "title": "Высокое качество звука",
            "content":
              "Наслаждайтесь музыкой в высоком качестве с помощью нашего сервиса потоковой передачи аудио премиум-класса.",
          },
          "new-artists": {
            "title": "Новые исполнители",
            "content":
              "Откройте для себя новые таланты и расширьте свой музыкальный кругозор с помощью наших тщательно подобранных плейлистов начинающих исполнителей.",
          },
          "new-genres": {
            "title": "Новые жанры и ощущения",
            "content":
              "Исследуйте широкий спектр жанров и настроений: от веселых танцевальных треков до расслабляющего эмбиента.",
          },
          "new-opportunities": {
            "title": "Делитесь своим музыкальным вкусом с друзьями.",
            "content":
              "Общайтесь с друзьями и делитесь своими любимыми музыкальными открытиями, создавая персонализированные впечатления от прослушивания.",
          },
          "uploaded-tracks": {
            "title": "Загружайте свои треки и слушайте их на одной платформе!",
            "content":
              "Загрузите свои собственные треки и развивайтесь, как автор.",
          },
        },
        "intro": {
          "quote": "Наслаждайся моментом, оценивай авторов, делись треками - действуй!",
          "quote-author": "- лидер Smotify",
          "main-title": "Что такое Smotify?",
          "main-subtitle": "сервис для прослушивания, добавления треков.",
        },
      },
    },
    "about": {
      "about-widgets": {
        "unleash": `Smotify дает музыкантам всех уровней возможность поделиться своим талантом со всем миром.
          Загружайте свои оригинальные треки, создавайте плейлисты и привлекайте новых подписчиков.
          поклонники. Наша удобная платформа позволяет легко демонстрировать свою музыку и подключаться к
          глобальная аудитория.`,
        "explore": `Погрузитесь в обширную музыкальную библиотеку Smotify, охватывающую жанры и эпохи. Откройте для себя новых художников,
          исследуйте скрытые сокровища и создавайте персонализированные плейлисты, отражающие ваш уникальный вкус. Наша разумная рекомендация
          система поможет вам найти музыку, которая вам понравится.`,
        "connect": `Smotify способствует развитию активного сообщества любителей музыки. Делитесь любимыми треками, обсуждайте новые релизы и общайтесь с
          друзья-фанаты, которые разделяют вашу страсть к музыке. Участвуйте в оживленных беседах и вместе открывайте для себя новую музыку.`,
      },
      "main-title": "Раскройте своего внутреннего музыканта.",
    },
  },
  "main-service": {
    "main-part": {
      "config": {
        "log-out": "Выйти",
        "log-in": "Войти",
        "sign-up": "Зарегистрироваться",
        "prev-page": "Назад",
        "next-page": "Далее",
        "liked-tracks-widget": "Любимые треки",
        "add-liked-songs": "Добавить в любимые",
        "appearance": "Внешний вид",
        "account": "Аккаунт",
        "language": "Язык",
        "theme": "Тема",

        "player": {
          "mute": "Выключить звук",
          "unmute": "Включить звук",
        },
        
        "publishing": {
          "success": "Трек опубликован",
        },
        
        "toast": {
          "log-out": "Выходим из аккаунта...",
          "add-liked-songs": "Добавлено в любимые треки",
          "remove-liked-songs": "Удалено из любимых треков",
        },
      
        "error": {
          "current-pathname": "Вы уже находитесь здесь",
          "song-published-error": "Произошла ошибка. Трек не опубликован",
          "song-image-error": "Не удалось загрузить изображение",
          "song-image-type-file": "Не удалось загрузить файл с этим расширением",
          "something-error": "Что-то произошло не так, попробуйте позже",
          "is-not-available": "Сейчас недоступно.",
        },

        "song-attributes": {
          "song-name": "Название",
          "song-author": "Автор",
          "song-playlist": "Плейлист",
          "song-id": "ID",
          "song-file": "Аудиофайл",
          "song-image": "Обложка",
        },

        "modal": {
          "upload": {
            "title": "Публикация аудиозаписи",
            "note-title": "поля обязательно должны быть заполнены",
          },
          "auth": {
            "title": "Вход в аккаунт",
          },
          "submit": "Опубликовать",
        },
        "placeholder": {
          "fields": {
            "example": "например:",
          },
        },
      },
    },
    "sidebar": {
      "widgets": {
        "main-route": "Главная",
        "search-route": "Поиск",
        "settings-route": "Настройки",
        "media-library": "Моя медиатека",
        "hover-add-song": "Добавить аудиозапись",
      },
    },
    "pages": {
      "main-content": {
        "navbar": {
          "welcome-message": "Добрый день",
          "recommended-message": "Послушай это пока в сети",
          "no-available-tracks": "Нет доступных треков...",
        },
      },
      "search-content": {
        "navbar": {
          "welcome-message": "Поиск",
          "input-message": "Что на этот раз?",
        },
      },
      "liked-content": {
        "navbar": {
          "welcome-message": "Плейлист",
          "subtitle-message": "Любимые треки",
          "is-not-liked-songs": "Любимых треков пока нет.",
        },
      },
      "settings-content": {
        "navbar": {
          "welcome-message": "Настройки",
          "": "",
        },
      },
    },
  },
  "language": {
    "ru": "Русский",
    "en": "Английский",
  },
} as const;
